'''
В подобных задачах не всегда удобно и рационально использовать чертёжник "Черепаха",
 будь он представлен либо в виде пакета в Python, либо в ЯП Кумир.
Порой проще подойти к решению задачи с аналитической точки зрения (очень важны знания геометрии).
В этом методе нам нужно знать,
какие фигуры мы получаем при повороте на определенный градус + как находить угол наклона прямой.

k = tg(a) в y = kx + b
'''


def main():
    cnt = 0
    for x in range(1, 100):
        for y in range(100):
            if x / (3 ** 0.5) < y < (-x / (3 ** 0.5) + 10):
                cnt += 1

    print(cnt)


if __name__ == '__main__':
    main()
