'''
Рассматривается множество целых чисел, принадлежащих числовому отрезку [1005; 147870],
которые не имеют в своей записи цифру 1, и разность между максимальной и минимальной цифрой меньше четырёх.
Найдите количество таких чисел и двадцать пятое по порядку такое число,
 если считать эти числа в порядке от наибольшего к наименьшему.
В ответе запишите два целых числа: сначала количество, затем двадцать пятое по порядку такое число.
'''


def main():
    b = []
    number = 0
    for i in range(1005, 147870):
        m = str(i)
        a = [int(i) for i in m]
        if m.count('1') == 0:
            if (max(a) - min(a)) < 4:
                number += 1
                b.append(i)
    print(number, b[len(b) - 25])


if __name__ == "__main__":
    main()



