'''
 Рассматривается множество целых чисел, принадлежащих числовому отрезку [2495; 7083], которые удовлетворяют следующим условиям:


− запись в шестнадцатеричной системе счисления заканчивается на 1A или 1F;

− не кратны 5 и 9.

Найдите количество таких чисел и минимальное из них.
'''


def main():
    number = 0
    minimum = 7083
    for i in range(2495, 7084):
        if i % 5 != 0 and i % 9 != 0:
            m = i
            if m % 16 == 10 or m % 16 == 15:
                m //= 16
                if m % 16 == 1:
                    number += 1
                    if i < minimum:
                        minimum = i

    print(number, minimum)


if __name__ == "__main__":
    main()
